Revit 2027 API
FamilyInstance.RemoveCoping Method
Removes a coping (cut) from a steel beam.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RemoveCoping(
	FamilyInstance cutter
)
Public Function RemoveCoping (
	cutter As FamilyInstance
) As Boolean
public:
bool RemoveCoping(
	FamilyInstance^ cutter
)
member RemoveCoping :
        cutter : FamilyInstance -> bool
Parameters
cutter FamilyInstance
A steel beam or column for which this beam currently has a coping cut. May not be null or itself.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException | Thrown when 'cutter' is null.
ArgumentException | Thrown when 'cutter' refers to this instance.
InvalidOperationException | Thrown when regeneration fails.
Remarks
This function corresponds to Tools -> Remove coping in Revit Structure.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace